05-02-predicados.org
#+setupfile: static/setupfile.org
#+html_link_up: 05-axiomas.html
#+title: Predicados
#+options: toc:t

#+property: header-args:rust :tangle src/axioms/predicates.rs

Arquivo: ~axioms/predicates.rs~.

#+begin_src rust
use gc::Gc;
use crate::maj_list;
use crate::core::Maj;
use crate::core::MajState;
use super::primitives::{
    maj_car,
    maj_cdr,
    maj_err
};
#+end_src

** ~symbolp~: Teste de símbolo

#+begin_src rust
pub fn maj_symbolp(x: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Sym(_) = *x {
        return Maj::t();
    }
    Maj::nil()
}
#+end_src

** ~eq~: Teste de identidade simbólica

#+begin_src rust
pub fn maj_eq(x: Gc<Maj>, y: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Sym(idx) = *x {
        if let Maj::Sym(idy) = *y {
            if idx == idy {
                return Maj::t();
            }
        }
    }
    Maj::nil()
}
#+end_src

** ~nilp~: Teste de nulidade

#+begin_src rust
pub fn maj_nilp(x: Gc<Maj>) -> Gc<Maj> {
    maj_eq(x, Maj::nil())
}
#+end_src

** ~consp~: Teste de célula cons

#+begin_src rust
pub fn maj_consp(x: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Cons { car: _, cdr: _ } = *x {
        return Maj::t();
    }
    Maj::nil()
}
#+end_src

** ~atomp~: Teste de atomicidade

#+begin_src rust
pub fn maj_atomp(x: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Cons { car: _, cdr: _ } = *x {
        return Maj::nil()
    }
    Maj::t()
}
#+end_src

** ~charp~: Teste de caractere

#+begin_src rust
pub fn maj_charp(x: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Char(_) = *x {
        return Maj::t();
    }
    Maj::nil()
}
#+end_src

** ~char=~: Comparação de caracteres

#+begin_src rust
pub fn maj_char_equals(x: Gc<Maj>, y: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Char(xc) = *x.clone() {
        if let Maj::Char(yc) = *y.clone() {
            if xc == yc {
                Maj::t()
            } else {
                Maj::nil()
            }
        } else {
            maj_err(Maj::string("{} is not a character"),
                    maj_list!(y))
        }
    } else {
        maj_err(Maj::string("{} is not a character"),
                maj_list!(x))
    }
}
#+end_src

** ~streamp~: Teste de stream

#+begin_src rust
pub fn maj_streamp(x: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Stream(_) = *x {
        return Maj::t();
    }
    Maj::nil()
}
#+end_src

