doc/html/05-02-predicados.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 23:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Predicados</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="05-axiomas.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Predicados</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org00e923e">1. <code>symbolp</code>: Teste de símbolo</a></li>
<li><a href="#orgb948367">2. <code>eq</code>: Teste de identidade simbólica</a></li>
<li><a href="#orgdfe444d">3. <code>nilp</code>: Teste de nulidade</a></li>
<li><a href="#org7fcb34f">4. <code>consp</code>: Teste de célula cons</a></li>
<li><a href="#orgbdb2b51">5. <code>atomp</code>: Teste de atomicidade</a></li>
<li><a href="#org09db9c0">6. <code>charp</code>: Teste de caractere</a></li>
<li><a href="#orgdc784e7">7. <code>char=</code>: Comparação de caracteres</a></li>
<li><a href="#org95ebfde">8. <code>streamp</code>: Teste de stream</a></li>
<li><a href="#orgb31bec6">9. <code>numberp</code>: Teste de número</a>
<ul>
<li><a href="#org7b6d6c4">9.1. <code>integerp</code>: Teste de número inteiro</a></li>
<li><a href="#orgb426582">9.2. <code>floatp</code>: Teste de ponto flutuante</a></li>
<li><a href="#org2b85a7b">9.3. <code>fractionp</code>: Teste de fração</a></li>
<li><a href="#orgb566dc2">9.4. <code>complexp</code>: Teste de número complexo</a></li>
</ul>
</li>
<li><a href="#orgb90ee48">10. <code>vectorp</code>: Teste de vetor</a></li>
<li><a href="#orgdec07be">11. <code>id</code>: Teste de identidade</a></li>
<li><a href="#orgae9a683">12. <code>proper-list-p</code>: Teste de lista adequada</a></li>
<li><a href="#orgb0c893c">13. <code>stringp</code>: Teste de String</a></li>
<li><a href="#org75917b1">14. <code>literalp</code>: Teste de literal</a></li>
<li><a href="#org2b56a71">15. <code>primitivep</code>: Teste de primitivas</a></li>
<li><a href="#org93afb99">16. <code>closurep</code>: Teste de clausura</a></li>
<li><a href="#org08cc45a">17. <code>functionp</code>: Teste de função</a></li>
<li><a href="#org312793b">18. <code>macrop</code>: Teste de macro</a></li>
<li><a href="#org59c2d5f">19. <code>errorp</code>: Teste de erro</a></li>
<li><a href="#org2dd294e">20. <code>zerop</code>: Teste de nulidade numérica</a></li>
<li><a href="#org6ecefde">21. Registro em contexto global</a></li>
</ul>
</div>
</div>
<p>
Arquivo: <code>axioms/predicates.rs</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::<span style="color: #4ec9b0;">Gc</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::maj_list;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #4ec9b0;">Maj</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #4ec9b0;">MajState</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">super</span>::<span style="color: #569cd6;">primitives</span>::{
    maj_car,
    maj_cdr,
    maj_err
};
</pre>
</div>

<div id="outline-container-org00e923e" class="outline-2">
<h2 id="org00e923e"><span class="section-number-2">1.</span> <code>symbolp</code>: Teste de símbolo</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_symbolp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) = *x {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb948367" class="outline-2">
<h2 id="orgb948367"><span class="section-number-2">2.</span> <code>eq</code>: Teste de identidade simbólica</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_eq</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(idx) = *x {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(idy) = *y {
            <span style="color: #569cd6;">if</span> idx == idy {
                <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
            }
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdfe444d" class="outline-2">
<h2 id="orgdfe444d"><span class="section-number-2">3.</span> <code>nilp</code>: Teste de nulidade</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_nilp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    maj_eq(x, <span style="color: #4ec9b0;">Maj</span>::nil())
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7fcb34f" class="outline-2">
<h2 id="org7fcb34f"><span class="section-number-2">4.</span> <code>consp</code>: Teste de célula cons</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_consp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { <span style="color: #9cdcfe;">car</span>: _, <span style="color: #9cdcfe;">cdr</span>: _ } = *x {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbdb2b51" class="outline-2">
<h2 id="orgbdb2b51"><span class="section-number-2">5.</span> <code>atomp</code>: Teste de atomicidade</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_atomp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { <span style="color: #9cdcfe;">car</span>: _, <span style="color: #9cdcfe;">cdr</span>: _ } = *x {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil()
    }
    <span style="color: #4ec9b0;">Maj</span>::t()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org09db9c0" class="outline-2">
<h2 id="org09db9c0"><span class="section-number-2">6.</span> <code>charp</code>: Teste de caractere</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_charp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(_) = *x {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc784e7" class="outline-2">
<h2 id="orgdc784e7"><span class="section-number-2">7.</span> <code>char=</code>: Comparação de caracteres</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_char_equals</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(xc) = *x.clone() {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(yc) = *y.clone() {
            <span style="color: #569cd6;">if</span> xc == yc {
                <span style="color: #4ec9b0;">Maj</span>::t()
            } <span style="color: #569cd6;">else</span> {
                <span style="color: #4ec9b0;">Maj</span>::nil()
            }
        } <span style="color: #569cd6;">else</span> {
            maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a character"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(y))
        }
    } <span style="color: #569cd6;">else</span> {
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a character"</span>),
                <span style="color: #c586c0;">maj_list!</span>(x))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org95ebfde" class="outline-2">
<h2 id="org95ebfde"><span class="section-number-2">8.</span> <code>streamp</code>: Teste de stream</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_streamp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(_) = *x {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>
