05-02-predicados.org
** ~numberp~: Teste de número

#+begin_src rust
pub fn maj_numberp(x: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Number(_) = &*x {
        return Maj::t();
    }
    Maj::nil()
}
#+end_src

*** ~integerp~: Teste de número inteiro

#+begin_src rust
pub fn maj_integerp(x: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajNumber;
    if let Maj::Number(num) = &*x {
        if let MajNumber::Integer(_) = num {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

*** ~floatp~: Teste de ponto flutuante

#+begin_src rust
pub fn maj_floatp(x: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajNumber;
    if let Maj::Number(num) = &*x {
        if let MajNumber::Float(_) = num {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

*** ~fractionp~: Teste de fração

#+begin_src rust
pub fn maj_fractionp(x: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajNumber;
    if let Maj::Number(num) = &*x {
        if let MajNumber::Fraction(_, _) = num {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

*** ~complexp~: Teste de número complexo

#+begin_src rust
pub fn maj_complexp(x: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajNumber;
    if let Maj::Number(num) = &*x {
        if let MajNumber::Complex {
            real: _,
            imag: _
        } = num {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

** ~vectorp~: Teste de vetor

#+begin_src rust
pub fn maj_vectorp(x: Gc<Maj>) -> Gc<Maj> {
    if let Maj::Vector(_) = &*x {
        Maj::t()
    } else {
        Maj::nil()
    }
}
#+end_src

** ~id~: Teste de identidade

#+begin_src rust
pub fn maj_id(x: Gc<Maj>, y: Gc<Maj>) -> Gc<Maj> {
    match *x {
        Maj::Sym(_) => {
            if let Maj::Sym(_) = *y {
                return maj_eq(x, y);
            }
        },
        Maj::Char(chrx) => {
            if let Maj::Char(chry) = *y {
                if chrx == chry {
                    return Maj::t();
                }
            }
        },
        _ => {
            let x_ptr = Gc::into_raw(x);
            let y_ptr = Gc::into_raw(y);
            if x_ptr == y_ptr {
                return Maj::t();
            }
        }
    }
    Maj::nil()
}
#+end_src

