doc/html/05-02-predicados.html

<div id="outline-container-orgb31bec6" class="outline-2">
<h2 id="orgb31bec6"><span class="section-number-2">9.</span> <code>numberp</code>: Teste de número</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_numberp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(_) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>

<div id="outline-container-org7b6d6c4" class="outline-3">
<h3 id="org7b6d6c4"><span class="section-number-3">9.1.</span> <code>integerp</code>: Teste de número inteiro</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_integerp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajNumber</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Integer</span>(_) = num {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb426582" class="outline-3">
<h3 id="orgb426582"><span class="section-number-3">9.2.</span> <code>floatp</code>: Teste de ponto flutuante</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_floatp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajNumber</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Float</span>(_) = num {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b85a7b" class="outline-3">
<h3 id="org2b85a7b"><span class="section-number-3">9.3.</span> <code>fractionp</code>: Teste de fração</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_fractionp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajNumber</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Fraction</span>(_, _) = num {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb566dc2" class="outline-3">
<h3 id="orgb566dc2"><span class="section-number-3">9.4.</span> <code>complexp</code>: Teste de número complexo</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_complexp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajNumber</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Complex</span> {
            <span style="color: #9cdcfe;">real</span>: _,
            <span style="color: #9cdcfe;">imag</span>: _
        } = num {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb90ee48" class="outline-2">
<h2 id="orgb90ee48"><span class="section-number-2">10.</span> <code>vectorp</code>: Teste de vetor</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_vectorp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(_) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
        <span style="color: #4ec9b0;">Maj</span>::t()
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">Maj</span>::nil()
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdec07be" class="outline-2">
<h2 id="orgdec07be"><span class="section-number-2">11.</span> <code>id</code>: Teste de identidade</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_id</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">y</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">match</span> *x {
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) =&gt; {
            <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) = *y {
                <span style="color: #569cd6;">return</span> maj_eq(x, y);
            }
        },
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(chrx) =&gt; {
            <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(chry) = *y {
                <span style="color: #569cd6;">if</span> chrx == chry {
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
                }
            }
        },
        _ =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x_ptr</span> = <span style="color: #4ec9b0;">Gc</span>::into_raw(x);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y_ptr</span> = <span style="color: #4ec9b0;">Gc</span>::into_raw(y);
            <span style="color: #569cd6;">if</span> x_ptr == y_ptr {
                <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
            }
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>
