05-02-predicados.org
** ~proper-list-p~: Teste de lista adequada

Uma lista adequada  é qualquer lista que termina com  um símbolo ~nil~
apropriado. Então,  por exemplo, =(1 2 3)= é uma lista  adequada, mas
=(1 2 3 . 4)= não é. Isto fica evidente quando comparamos a impressão de
ambas as respectivas listas com notação de pontos:

- =(1 . (2 . (3 . nil)))=
- =(1 . (2 . (3 . 4)))=

Uma lista vazia (ou seja, o  próprio símbolo ~nil~) também é considerada
uma lista adequada.

#+begin_src rust
pub fn maj_proper_list_p(x: Gc<Maj>) -> Gc<Maj> {
    let is_cons = maj_consp(x.clone()).to_bool();
    let is_nil  = maj_nilp(x.clone()).to_bool();

    if !is_cons && !is_nil {
        return Maj::nil();
    }

    let mut itr = x.clone();
    while !maj_nilp(itr.clone()).to_bool()  {
        if let Maj::Cons { car: _, cdr } = &*itr.clone() {
            itr = cdr.clone();
        } else {
            return Maj::nil();
        }
    }
    Maj::t()
}
#+end_src

** ~stringp~: Teste de String

Uma  string é  um vetor  de caracteres.  Portanto, qualquer  vetor que
tenha ~char~ como seu tipo será uma string.

#+begin_src rust
pub fn maj_stringp(x: Gc<Maj>) -> Gc<Maj> {
    use crate::core::types::MajVector;
    if let Maj::Vector(v) = &*x {
        if let MajVector::Char(_) = &v {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

** ~literalp~: Teste de literal

Um  /literal/ é  toda lista  adequada que  seja iniciada  com o  símbolo
~lit~. Para  tanto, basta  que utilizemos  ~car~, das  funções primitivas,
para  identificar  tal  símbolo,  dado  que  a  lista  fornecida  seja
adequada.

#+begin_src rust
pub fn maj_literalp(x: Gc<Maj>) -> Gc<Maj> {
    if maj_proper_list_p(x.clone()).to_bool() &&
        maj_eq(maj_car(x.clone()), Maj::lit()).to_bool() {
            return Maj::t();
        }
    Maj::nil()
}
#+end_src

** ~primitivep~: Teste de primitivas

Uma /primitiva/ não possui  representação realmente. Todavia, utilizamos
literais para  representá-la no sistema; essas  literais servirão para
invocarmos  tais  primitivas, como  se  fossem  clausuras, onde  forem
necessárias.

A representação literal de uma primitiva tem, como segundo elemento, o
símbolo ~prim~.

#+begin_src rust
pub fn maj_primitivep(x: Gc<Maj>) -> Gc<Maj> {
    if maj_literalp(x.clone()).to_bool() {
        let sym = maj_car(maj_cdr(x));
        if maj_eq(sym, Maj::prim()).to_bool() {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

** ~closurep~: Teste de clausura

Uma /clausura/ é definida como uma /literal/, tal que seu segundo elemento
seja exatamente  o símbolo  ~closure~. Podemos utilizar  ~car~ e  ~cdr~ para
realizar essa comparação.

#+begin_src rust
pub fn maj_closurep(x: Gc<Maj>) -> Gc<Maj> {
    if maj_literalp(x.clone()).to_bool() {
        let sym = maj_car(maj_cdr(x));
        if maj_eq(sym, Maj::closure()).to_bool() {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

** ~functionp~: Teste de função

Uma  função é  um  termo  genérico que  designa  uma  clausura ou  uma
primitiva. Sendo assim, qualquer desses dois será uma função.

#+begin_src rust
pub fn maj_functionp(x: Gc<Maj>) -> Gc<Maj> {
    if maj_primitivep(x.clone()).to_bool()
        || maj_closurep(x).to_bool()
    {
        return Maj::t();
    }
    Maj::nil()
}
#+end_src

** ~macrop~: Teste de macro

Um  /macro/ também  é  definido como  um /literal/,  tal  que seu  segundo
elemento seja exatamente o símbolo /macro/, e seu terceiro elemento seja
uma /clausura/.

#+begin_src rust
pub fn maj_macrop(x: Gc<Maj>) -> Gc<Maj> {
    if maj_literalp(x.clone()).to_bool() {
        let sym = maj_car(maj_cdr(x));
        if maj_eq(sym, Maj::macro_sym()).to_bool() {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

