doc/html/05-02-predicados.html

<div id="outline-container-orgae9a683" class="outline-2">
<h2 id="orgae9a683"><span class="section-number-2">12.</span> <code>proper-list-p</code>: Teste de lista adequada</h2>
<div class="outline-text-2" id="text-12">
<p>
Uma lista adequada  é qualquer lista que termina com  um símbolo <code>nil</code>
apropriado. Então,  por exemplo, <code>(1 2 3)</code> é uma lista  adequada, mas
<code>(1 2 3 . 4)</code> não é. Isto fica evidente quando comparamos a impressão de
ambas as respectivas listas com notação de pontos:
</p>

<ul class="org-ul">
<li><code>(1 . (2 . (3 . nil)))</code></li>
<li><code>(1 . (2 . (3 . 4)))</code></li>
</ul>

<p>
Uma lista vazia (ou seja, o  próprio símbolo <code>nil</code>) também é considerada
uma lista adequada.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_proper_list_p</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">is_cons</span> = maj_consp(x.clone()).to_bool();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">is_nil</span>  = maj_nilp(x.clone()).to_bool();

    <span style="color: #569cd6;">if</span> !is_cons &amp;&amp; !is_nil {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil();
    }

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">itr</span> = x.clone();
    <span style="color: #569cd6;">while</span> !maj_nilp(itr.clone()).to_bool()  {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { <span style="color: #9cdcfe;">car</span>: _, cdr } = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*itr.clone() {
            itr = cdr.clone();
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::t()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0c893c" class="outline-2">
<h2 id="orgb0c893c"><span class="section-number-2">13.</span> <code>stringp</code>: Teste de String</h2>
<div class="outline-text-2" id="text-13">
<p>
Uma  string é  um vetor  de caracteres.  Portanto, qualquer  vetor que
tenha <code>char</code> como seu tipo será uma string.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_stringp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(v) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(_) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>v {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org75917b1" class="outline-2">
<h2 id="org75917b1"><span class="section-number-2">14.</span> <code>literalp</code>: Teste de literal</h2>
<div class="outline-text-2" id="text-14">
<p>
Um  <i>literal</i> é  toda lista  adequada que  seja iniciada  com o  símbolo
<code>lit</code>. Para  tanto, basta  que utilizemos  <code>car</code>, das  funções primitivas,
para  identificar  tal  símbolo,  dado  que  a  lista  fornecida  seja
adequada.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_literalp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_proper_list_p(x.clone()).to_bool() &amp;&amp;
        maj_eq(maj_car(x.clone()), <span style="color: #4ec9b0;">Maj</span>::lit()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b56a71" class="outline-2">
<h2 id="org2b56a71"><span class="section-number-2">15.</span> <code>primitivep</code>: Teste de primitivas</h2>
<div class="outline-text-2" id="text-15">
<p>
Uma <i>primitiva</i> não possui  representação realmente. Todavia, utilizamos
literais para  representá-la no sistema; essas  literais servirão para
invocarmos  tais  primitivas, como  se  fossem  clausuras, onde  forem
necessárias.
</p>

<p>
A representação literal de uma primitiva tem, como segundo elemento, o
símbolo <code>prim</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_primitivep</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_literalp(x.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span> = maj_car(maj_cdr(x));
        <span style="color: #569cd6;">if</span> maj_eq(sym, <span style="color: #4ec9b0;">Maj</span>::prim()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org93afb99" class="outline-2">
<h2 id="org93afb99"><span class="section-number-2">16.</span> <code>closurep</code>: Teste de clausura</h2>
<div class="outline-text-2" id="text-16">
<p>
Uma <i>clausura</i> é definida como uma <i>literal</i>, tal que seu segundo elemento
seja exatamente  o símbolo  <code>closure</code>. Podemos utilizar  <code>car</code> e  <code>cdr</code> para
realizar essa comparação.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_closurep</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_literalp(x.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span> = maj_car(maj_cdr(x));
        <span style="color: #569cd6;">if</span> maj_eq(sym, <span style="color: #4ec9b0;">Maj</span>::closure()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org08cc45a" class="outline-2">
<h2 id="org08cc45a"><span class="section-number-2">17.</span> <code>functionp</code>: Teste de função</h2>
<div class="outline-text-2" id="text-17">
<p>
Uma  função é  um  termo  genérico que  designa  uma  clausura ou  uma
primitiva. Sendo assim, qualquer desses dois será uma função.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_functionp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_primitivep(x.clone()).to_bool()
        || maj_closurep(x).to_bool()
    {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org312793b" class="outline-2">
<h2 id="org312793b"><span class="section-number-2">18.</span> <code>macrop</code>: Teste de macro</h2>
<div class="outline-text-2" id="text-18">
<p>
Um  <i>macro</i> também  é  definido como  um <i>literal</i>,  tal  que seu  segundo
elemento seja exatamente o símbolo <i>macro</i>, e seu terceiro elemento seja
uma <i>clausura</i>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_macrop</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_literalp(x.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span> = maj_car(maj_cdr(x));
        <span style="color: #569cd6;">if</span> maj_eq(sym, <span style="color: #4ec9b0;">Maj</span>::macro_sym()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>
