05-02-predicados.org
** ~errorp~: Teste de erro

Pela mesma lógica de ~closurep~ e ~primitivep~, erros também são literais,
onde o segundo elemento precisa  ser o símbolo ~error~. Demais elementos
serão a string de formato, e  então demais objetos que ajudem a compor
esse formato.

#+begin_src rust
pub fn maj_errorp(x: Gc<Maj>) -> Gc<Maj> {
    if maj_proper_list_p(x.clone()).to_bool() {
        let sym = maj_car(maj_cdr(x));
        if maj_eq(sym, Maj::error()).to_bool() {
            return Maj::t();
        }
    }
    Maj::nil()
}
#+end_src

** ~zerop~: Teste de nulidade numérica

(v. comparação numérica)

#+begin_src rust
pub fn maj_zerop(
    mut state: &mut MajState,
    env: Gc<Maj>,
    x: Gc<Maj>
) -> Gc<Maj> {
    use crate::axioms::primitives::maj_arithm_eq;
    maj_arithm_eq(&mut state, env,
                  Maj::integer(0), x, Maj::nil())
}
#+end_src

