doc/html/05-02-predicados.html

<div id="outline-container-org59c2d5f" class="outline-2">
<h2 id="org59c2d5f"><span class="section-number-2">19.</span> <code>errorp</code>: Teste de erro</h2>
<div class="outline-text-2" id="text-19">
<p>
Pela mesma lógica de <code>closurep</code> e <code>primitivep</code>, erros também são literais,
onde o segundo elemento precisa  ser o símbolo <code>error</code>. Demais elementos
serão a string de formato, e  então demais objetos que ajudem a compor
esse formato.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_errorp</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> maj_proper_list_p(x.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span> = maj_car(maj_cdr(x));
        <span style="color: #569cd6;">if</span> maj_eq(sym, <span style="color: #4ec9b0;">Maj</span>::error()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::t();
        }
    }
    <span style="color: #4ec9b0;">Maj</span>::nil()
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2dd294e" class="outline-2">
<h2 id="org2dd294e"><span class="section-number-2">20.</span> <code>zerop</code>: Teste de nulidade numérica</h2>
<div class="outline-text-2" id="text-20">
<p>
(v. comparação numérica)
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_zerop</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_arithm_eq;
    maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
                  <span style="color: #4ec9b0;">Maj</span>::integer(0), x, <span style="color: #4ec9b0;">Maj</span>::nil())
}
</pre>
</div>
</div>
</div>
