05-02-predicados.org
** Registro em contexto global

De volta a ~axioms/predicates.rs~

#+begin_src rust
pub fn maj_gen_predicates(state: &mut MajState) {
    use crate::axioms::{ MajPrimFn, MajPrimArgs };
    use crate::maj_destructure_args;

    let predicates: Vec<(&str, MajPrimArgs, MajPrimFn)> = vec![
        ("symbolp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_symbolp(first)
        }),
        ("eq", MajPrimArgs::Required(2), |_, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_eq(first, second)
        }),
        ("nilp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_nilp(first)
        }),
        ("consp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_consp(first)
        }),
        ("atomp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_atomp(first)
        }),
        ("charp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_charp(first)
        }),
        ("char=", MajPrimArgs::Required(2), |_, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_char_equals(first, second)
        }),
        ("streamp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_streamp(first)
        }),
        ("numberp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_numberp(first)
        }),
        ("integerp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_integerp(first)
        }),
        ("floatp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_floatp(first)
        }),
        ("fractionp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_fractionp(first)
        }),
        ("complexp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_complexp(first)
        }),
        ("vectorp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_vectorp(first)
        }),
        ("id", MajPrimArgs::Required(2), |_, args, _| {
            maj_destructure_args!(args, first, rest, second);
            maj_id(first, second)
        }),
        ("proper-list-p", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_proper_list_p(first)
        }),
        ("stringp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_stringp(first)
        }),
        ("literalp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_literalp(first)
        }),
        ("primitivep", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_primitivep(first)
        }),
        ("closurep", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_closurep(first)
        }),
        ("functionp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_functionp(first)
        }),
        ("macrop", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_macrop(first)
        }),
        ("errorp", MajPrimArgs::Required(1), |_, args, _| {
            maj_destructure_args!(args, first);
            maj_errorp(first)
        }),
        ("zerop", MajPrimArgs::Required(1),
         |mut state, args, env| {
             maj_destructure_args!(args, first);
             maj_zerop(&mut state, env, first)
         }),
    ];

    for predicate in predicates.iter() {
        let (name, arity, f) = predicate;
        state.register_primitive(name, *arity, *f);
    }
}
#+end_src

