doc/html/05-02-predicados.html

<div id="outline-container-org6ecefde" class="outline-2">
<h2 id="org6ecefde"><span class="section-number-2">21.</span> Registro em contexto global</h2>
<div class="outline-text-2" id="text-21">
<p>
De volta a <code>axioms/predicates.rs</code>
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_gen_predicates</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>) {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::{ <span style="color: #4ec9b0;">MajPrimFn</span>, <span style="color: #4ec9b0;">MajPrimArgs</span> };
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::maj_destructure_args;

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">predicates</span>: <span style="color: #4ec9b0;">Vec</span>&lt;(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">str</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>, <span style="color: #4ec9b0;">MajPrimFn</span>)&gt; = <span style="color: #c586c0;">vec!</span>[
        (<span style="color: #ce9178;">"symbolp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_symbolp(first)
        }),
        (<span style="color: #ce9178;">"eq"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_eq(first, second)
        }),
        (<span style="color: #ce9178;">"nilp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_nilp(first)
        }),
        (<span style="color: #ce9178;">"consp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_consp(first)
        }),
        (<span style="color: #ce9178;">"atomp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_atomp(first)
        }),
        (<span style="color: #ce9178;">"charp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_charp(first)
        }),
        (<span style="color: #ce9178;">"char="</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_char_equals(first, second)
        }),
        (<span style="color: #ce9178;">"streamp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_streamp(first)
        }),
        (<span style="color: #ce9178;">"numberp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_numberp(first)
        }),
        (<span style="color: #ce9178;">"integerp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_integerp(first)
        }),
        (<span style="color: #ce9178;">"floatp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_floatp(first)
        }),
        (<span style="color: #ce9178;">"fractionp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_fractionp(first)
        }),
        (<span style="color: #ce9178;">"complexp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_complexp(first)
        }),
        (<span style="color: #ce9178;">"vectorp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_vectorp(first)
        }),
        (<span style="color: #ce9178;">"id"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(2), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first, rest, second);
            maj_id(first, second)
        }),
        (<span style="color: #ce9178;">"proper-list-p"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_proper_list_p(first)
        }),
        (<span style="color: #ce9178;">"stringp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_stringp(first)
        }),
        (<span style="color: #ce9178;">"literalp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_literalp(first)
        }),
        (<span style="color: #ce9178;">"primitivep"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_primitivep(first)
        }),
        (<span style="color: #ce9178;">"closurep"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_closurep(first)
        }),
        (<span style="color: #ce9178;">"functionp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_functionp(first)
        }),
        (<span style="color: #ce9178;">"macrop"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_macrop(first)
        }),
        (<span style="color: #ce9178;">"errorp"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1), |_, args, _| {
            <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
            maj_errorp(first)
        }),
        (<span style="color: #ce9178;">"zerop"</span>, <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(1),
         |<span style="color: #569cd6;">mut</span> state, args, env| {
             <span style="color: #c586c0;">maj_destructure_args!</span>(args, first);
             maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env, first)
         }),
    ];

    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">predicate</span> <span style="color: #569cd6;">in</span> predicates.iter() {
        <span style="color: #569cd6;">let</span> (name, arity, f) = predicate;
        state.register_primitive(name, *arity, *f);
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 23:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
